In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [134]:
df = pd.read_csv("../data/total_production.csv").drop(columns=["Unnamed: 1"])
df.head()

,Crop year,1990/91,1991/92,1992/93,1993/94,1994/95,1995/96,1996/97,1997/98,1998/99,...,2010/11,2011/12,2012/13,2013/14,2014/15,2015/16,2016/17,2017/18,2018/19,2019/20
0,April group,"40,795","42,530","46,868","40,167","39,990","29,396","44,298","39,476","50,892",...,"71,811","64,395","75,896","74,494","69,873","71,332","75,508","70,324","81,708","76,076"
1,Angola,50,79,78,33,77,62,71,64,85,...,35,29,33,35,39,41,45,35,42,52
2,Bolivia (Plurinational State of),123,104,120,51,117,142,125,141,138,...,117,132,105,120,100,84,78,84,83,81
3,Brazil,"27,286","27,293","34,603","28,167","28,192","18,060","29,197","26,148","36,761",...,"55,428","48,592","55,418","54,689","53,305","52,871","56,788","52,740","65,131","58,211"
4,Burundi,487,667,620,393,664,434,401,250,492,...,353,204,406,163,248,269,196,202,204,272

In [135]:
df = df.melt(id_vars=["Crop year"], var_name="year", value_name="units").rename(columns={"Crop year": "country"})

In [136]:
def assign_country_groups(df, group_name, country_list):
  df2 = pd.DataFrame(df[df["country"].isin(country_list)])
  df2.loc[:, "group"] = np.repeat(group_name, len(df2.index))
  return df2

In [137]:
assign_country_groups(df, "april", ["Angola",
"Bolivia (Plurinational State of)",
"Brazil",
"Burundi",
"Ecuador",
"Indonesia",
"Madagascar",
"Malawi",
"Papua New Guinea",
"Paraguay",
"Peru",
"Rwanda",
"Timor-Leste",
"Zimbabwe"])

                               country     year   units  group
1                               Angola  1990/91      50  april
2     Bolivia (Plurinational State of)  1990/91     123  april
3                               Brazil  1990/91  27,286  april
4                              Burundi  1990/91     487  april
5                              Ecuador  1990/91   1,504  april
...                                ...      ...     ...    ...
1721                          Paraguay  2019/20      20  april
1722                              Peru  2019/20   3,836  april
1723                            Rwanda  2019/20     348  april
1724                       Timor-Leste  2019/20     103  april
1725                          Zimbabwe  2019/20       9  april

[420 rows x 4 columns]